app/controllers/connect4_controller.rb

DELETE FROM `nodes` WHERE `nodes`.`id` = 758
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (0, 1, '', '2018-07-07 15:34:28', '2018-07-07 15:34:28')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (0, 2, '', '2018-07-07 15:34:28', '2018-07-07 15:34:28')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (0, 3, '', '2018-07-07 15:34:28', '2018-07-07 15:34:28')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (0, 4, '', '2018-07-07 15:34:28', '2018-07-07 15:34:28')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (0, 5, '', '2018-07-07 15:34:28', '2018-07-07 15:34:28')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (0, 6, '', '2018-07-07 15:34:28', '2018-07-07 15:34:28')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (0, 6, '', '2018-07-07 20:25:14', '2018-07-07 20:25:14')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (1, 1, '', '2018-07-07 15:11:22', '2018-07-07 15:11:22')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (1, 2, '', '2018-07-07 15:34:28', '2018-07-07 15:34:28')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (1, 3, '', '2018-07-07 15:34:28', '2018-07-07 15:34:28')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (1, 4, '', '2018-07-07 15:34:28', '2018-07-07 15:34:28')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (1, 5, '', '2018-07-07 15:34:28', '2018-07-07 15:34:28')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (1, 6, '', '2018-07-07 15:34:28', '2018-07-07 15:34:28')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (1, 6, '', '2018-07-07 20:25:14', '2018-07-07 20:25:14')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (2, 1, '', '2018-07-07 15:34:28', '2018-07-07 15:34:28')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (2, 2, '', '2018-07-07 15:11:22', '2018-07-07 15:11:22')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (2, 3, '', '2018-07-07 15:34:28', '2018-07-07 15:34:28')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (2, 4, '', '2018-07-07 15:34:28', '2018-07-07 15:34:28')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (2, 5, '', '2018-07-07 15:34:28', '2018-07-07 15:34:28')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (2, 6, '', '2018-07-07 15:34:28', '2018-07-07 15:34:28')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (2, 6, '', '2018-07-07 20:25:14', '2018-07-07 20:25:14')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (3, 1, '', '2018-07-07 15:34:28', '2018-07-07 15:34:28')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (3, 2, '', '2018-07-07 15:34:28', '2018-07-07 15:34:28')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (3, 3, '', '2018-07-07 15:11:22', '2018-07-07 15:11:22')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (3, 4, '', '2018-07-07 15:34:28', '2018-07-07 15:34:28')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (3, 5, '', '2018-07-07 15:34:28', '2018-07-07 15:34:28')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (3, 6, '', '2018-07-07 15:34:28', '2018-07-07 15:34:28')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (3, 6, '', '2018-07-07 20:25:14', '2018-07-07 20:25:14')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (4, 1, '', '2018-07-07 15:34:29', '2018-07-07 15:34:29')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (4, 2, '', '2018-07-07 15:34:29', '2018-07-07 15:34:29')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (4, 3, '', '2018-07-07 15:34:29', '2018-07-07 15:34:29')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (4, 4, '', '2018-07-07 15:11:22', '2018-07-07 15:11:22')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (4, 5, '', '2018-07-07 15:34:29', '2018-07-07 15:34:29')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (4, 6, '', '2018-07-07 15:34:29', '2018-07-07 15:34:29')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (4, 6, '', '2018-07-07 20:25:15', '2018-07-07 20:25:15')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (5, 1, '', '2018-07-07 15:34:29', '2018-07-07 15:34:29')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (5, 2, '', '2018-07-07 15:34:29', '2018-07-07 15:34:29')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (5, 3, '', '2018-07-07 15:34:29', '2018-07-07 15:34:29')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (5, 4, '', '2018-07-07 15:34:29', '2018-07-07 15:34:29')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (5, 5, '', '2018-07-07 15:11:22', '2018-07-07 15:11:22')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (5, 6, '', '2018-07-07 15:34:29', '2018-07-07 15:34:29')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (5, 6, '', '2018-07-07 20:25:15', '2018-07-07 20:25:15')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (6, 1, '', '2018-07-07 15:34:29', '2018-07-07 15:34:29')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (6, 2, '', '2018-07-07 15:34:29', '2018-07-07 15:34:29')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (6, 3, '', '2018-07-07 15:34:29', '2018-07-07 15:34:29')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (6, 4, '', '2018-07-07 15:34:29', '2018-07-07 15:34:29')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (6, 5, '', '2018-07-07 15:34:29', '2018-07-07 15:34:29')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (6, 6, '', '2018-07-07 15:11:23', '2018-07-07 15:11:23')
INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (6, 6, '', '2018-07-07 20:25:15', '2018-07-07 20:25:15')
DELETE FROM `players` WHERE `players`.`id` = 1
INSERT INTO `players` (`active`, `winTimes`, `created_at`, `updated_at`, `name`, `winner`) VALUES (TRUE, 0, '2018-07-07 20:25:15', '2018-07-07 20:25:15', 'A', FALSE)
INSERT INTO `players` (`active`, `winTimes`, `created_at`, `updated_at`, `name`, `winner`) VALUES (FALSE, 0, '2018-07-07 20:25:15', '2018-07-07 20:25:15', 'B', FALSE)
---
  def init
    Node.destroy_all
    # row 1
    Node.create(:rowNumber => 0, :columnNumber => 0, :belongsTo => '')
    Node.create(:rowNumber => 0, :columnNumber => 1, :belongsTo => '')
    Node.create(:rowNumber => 0, :columnNumber => 2, :belongsTo => '')
    Node.create(:rowNumber => 0, :columnNumber => 3, :belongsTo => '')
    Node.create(:rowNumber => 0, :columnNumber => 4, :belongsTo => '')
    Node.create(:rowNumber => 0, :columnNumber => 5, :belongsTo => '')
    Node.create(:rowNumber => 0, :columnNumber => 6, :belongsTo => '')
    # row 2
    Node.create(:rowNumber => 1, :columnNumber => 0, :belongsTo => '')
    Node.create(:rowNumber => 1, :columnNumber => 1, :belongsTo => '')
    Node.create(:rowNumber => 1, :columnNumber => 2, :belongsTo => '')
    Node.create(:rowNumber => 1, :columnNumber => 3, :belongsTo => '')
    Node.create(:rowNumber => 1, :columnNumber => 4, :belongsTo => '')
    Node.create(:rowNumber => 1, :columnNumber => 5, :belongsTo => '')
    Node.create(:rowNumber => 1, :columnNumber => 6, :belongsTo => '')
    # row 3
    Node.create(:rowNumber => 2, :columnNumber => 0, :belongsTo => '')
    Node.create(:rowNumber => 2, :columnNumber => 1, :belongsTo => '')
    Node.create(:rowNumber => 2, :columnNumber => 2, :belongsTo => '')
    Node.create(:rowNumber => 2, :columnNumber => 3, :belongsTo => '')
    Node.create(:rowNumber => 2, :columnNumber => 4, :belongsTo => '')
    Node.create(:rowNumber => 2, :columnNumber => 5, :belongsTo => '')
    Node.create(:rowNumber => 2, :columnNumber => 6, :belongsTo => '')
    # row 4
    Node.create(:rowNumber => 3, :columnNumber => 0, :belongsTo => '')
    Node.create(:rowNumber => 3, :columnNumber => 1, :belongsTo => '')
    Node.create(:rowNumber => 3, :columnNumber => 2, :belongsTo => '')
    Node.create(:rowNumber => 3, :columnNumber => 3, :belongsTo => '')
    Node.create(:rowNumber => 3, :columnNumber => 4, :belongsTo => '')
    Node.create(:rowNumber => 3, :columnNumber => 5, :belongsTo => '')
    Node.create(:rowNumber => 3, :columnNumber => 6, :belongsTo => '')
    # row 5
    Node.create(:rowNumber => 4, :columnNumber => 0, :belongsTo => '')
    Node.create(:rowNumber => 4, :columnNumber => 1, :belongsTo => '')
    Node.create(:rowNumber => 4, :columnNumber => 2, :belongsTo => '')
    Node.create(:rowNumber => 4, :columnNumber => 3, :belongsTo => '')
    Node.create(:rowNumber => 4, :columnNumber => 4, :belongsTo => '')
    Node.create(:rowNumber => 4, :columnNumber => 5, :belongsTo => '')
    Node.create(:rowNumber => 4, :columnNumber => 6, :belongsTo => '')
    # row 6
    Node.create(:rowNumber => 5, :columnNumber => 0, :belongsTo => '')
    Node.create(:rowNumber => 5, :columnNumber => 1, :belongsTo => '')
    Node.create(:rowNumber => 5, :columnNumber => 2, :belongsTo => '')
    Node.create(:rowNumber => 5, :columnNumber => 3, :belongsTo => '')
    Node.create(:rowNumber => 5, :columnNumber => 4, :belongsTo => '')
    Node.create(:rowNumber => 5, :columnNumber => 5, :belongsTo => '')
    Node.create(:rowNumber => 5, :columnNumber => 6, :belongsTo => '')
    # row 7
    Node.create(:rowNumber => 6, :columnNumber => 0, :belongsTo => '')
    Node.create(:rowNumber => 6, :columnNumber => 1, :belongsTo => '')
    Node.create(:rowNumber => 6, :columnNumber => 2, :belongsTo => '')
    Node.create(:rowNumber => 6, :columnNumber => 3, :belongsTo => '')
    Node.create(:rowNumber => 6, :columnNumber => 4, :belongsTo => '')
    Node.create(:rowNumber => 6, :columnNumber => 5, :belongsTo => '')
    Node.create(:rowNumber => 6, :columnNumber => 6, :belongsTo => '')

    Player.destroy_all
    Player.create(:name => 'A', :active => true, :winTimes => 0, :winner => false)
    Player.create(:name => 'B', :active => false, :winTimes => 0, :winner => false)