app/controllers/nodes_controller.rb

UPDATE `players` SET `active` = FALSE, `updated_at` = '2018-07-08 02:21:09' WHERE `players`.`id` = 53
UPDATE `players` SET `active` = TRUE, `updated_at` = '2018-07-08 02:21:09' WHERE `players`.`id` = 54
---
    def click1
        index
        for i in 0..6
            while @column1[i].belongsTo == ''
                @column1[i].belongsTo = @player.name
                @column1[i].save
                @player.active = false
                @player.save
                @inActivePlayer.active = true
                @inActivePlayer.save

UPDATE `players` SET `active` = FALSE, `updated_at` = '2018-07-08 02:21:07' WHERE `players`.`id` = 53
UPDATE `players` SET `active` = TRUE, `updated_at` = '2018-07-08 02:21:07' WHERE `players`.`id` = 54
---
    def click2
        index
        for i in 0..6
            while @column2[i].belongsTo == ''
                @column2[i].belongsTo = @player.name
                @column2[i].save
                @player.active = false
                @player.save
                @inActivePlayer.active = true
                @inActivePlayer.save

UPDATE `players` SET `winner` = TRUE WHERE `players`.`id` = 61
UPDATE `players` SET `active` = FALSE, `updated_at` = '2018-07-08 02:04:46' WHERE `players`.`id` = 53
---
    def click3
        index
        for i in 0..6
            while @column3[i].belongsTo == ''
                @column3[i].belongsTo = @player.name
                @column3[i].save
                @player.active = false
                @player.save
                @inActivePlayer.active = true
                @inActivePlayer.save

UPDATE `players` SET `active` = FALSE, `updated_at` = '2018-07-08 02:21:08' WHERE `players`.`id` = 54
UPDATE `players` SET `active` = TRUE, `updated_at` = '2018-07-08 02:21:08' WHERE `players`.`id` = 53
---
    def click4
        index
        for i in 0..6
            while @column4[i].belongsTo == ''
                @column4[i].belongsTo = @player.name
                @column4[i].save
                @player.active = false
                @player.save
                @inActivePlayer.active = true
                @inActivePlayer.save

UPDATE `players` SET `active` = FALSE, `updated_at` = '2018-07-08 02:21:05' WHERE `players`.`id` = 54
UPDATE `players` SET `active` = TRUE, `updated_at` = '2018-07-08 02:21:05' WHERE `players`.`id` = 53
---
    def click5
        index
        for i in 0..6
            while @column5[i].belongsTo == ''
                @column5[i].belongsTo = @player.name
                @column5[i].save
                @player.active = false
                @player.save
                @inActivePlayer.active = true
                @inActivePlayer.save

UPDATE `players` SET `active` = FALSE, `updated_at` = '2018-07-08 02:20:59' WHERE `players`.`id` = 53
UPDATE `players` SET `active` = TRUE, `updated_at` = '2018-07-08 02:20:59' WHERE `players`.`id` = 54
---
    def click6
        index
        for i in 0..6
            while @column6[i].belongsTo == ''
                @column6[i].belongsTo = @player.name
                @column6[i].save
                @player.active = false
                @player.save
                @inActivePlayer.active = true
                @inActivePlayer.save

UPDATE `players` SET `active` = FALSE, `updated_at` = '2018-07-08 02:20:58' WHERE `players`.`id` = 54
UPDATE `players` SET `active` = TRUE, `updated_at` = '2018-07-08 02:20:58' WHERE `players`.`id` = 53
---
    def click7
        index
        for i in 0..6
            while @column7[i].belongsTo == ''
                @column7[i].belongsTo = @player.name
                @column7[i].save
                @player.active = false
                @player.save
                @inActivePlayer.active = true
                @inActivePlayer.save