app/controllers/nodes_controller.rb

SELECT `nodes`.* FROM `nodes`
SELECT `players`.* FROM `players`
---
    def index
        @nodes = Node.all
        getRowAndColumn
        @players = Player.all
        @winnername = ''
        @players.each do |p|

INSERT INTO `nodes` (`rowNumber`, `columnNumber`, `belongsTo`, `created_at`, `updated_at`) VALUES (1, 1, 'sdf', '2018-07-07 14:55:46', '2018-07-07 14:55:46')
---
    def create
        @node = Node.new(node_params)
        @node.save

UPDATE `players` SET `active` = FALSE, `updated_at` = '2018-07-07 19:35:56' WHERE `players`.`id` = 19
---
        # If there are
        if count == 4
            currentPlayer.winner = true
            currentPlayer.save

UPDATE `nodes` SET `belongsTo` = 'B', `updated_at` = '2018-07-07 21:00:30' WHERE `nodes`.`id` = 1151
UPDATE `players` SET `winner` = TRUE WHERE `players`.`id` = 63
---
    def checkRightDiagonal(rowNumber, columnNumber, rowArray)
        downleft = [columnNumber,rowNumber]
        upright = [columnNumber+1,rowNumber+1]
        count = 0
        currentPlayer = @player

        until downleft[0]<0||downleft[1]<0||count==4
            if isCurrentPlayerNode(downleft[1], downleft[0], rowArray, currentPlayer.name)
                count+=1
                downleft[0] -=1
                downleft[1] -=1
            else
                break
            end
        end

        until upright[0]>6||upright[1]>6||count==4
            if isCurrentPlayerNode(upright[1], upright[0], rowArray, currentPlayer.name)
                count+=1
                upright[0]+=1
                upright[1]+=1
            else
                break
            end
        end

        if count == 4
            currentPlayer.winner = true
            currentPlayer.save

UPDATE `players` SET `active` = FALSE, `updated_at` = '2018-07-07 23:42:43' WHERE `players`.`id` = 47
UPDATE `players` SET `active` = TRUE, `updated_at` = '2018-07-07 23:42:43' WHERE `players`.`id` = 48
---
    def click1
        index
        for i in 0..6
            while @column1[i].belongsTo == ''
                @column1[i].belongsTo = @player.name
                @column1[i].save
                @player.active = false
                @player.save
                @inActivePlayer.active = true
                @inActivePlayer.save

UPDATE `players` SET `active` = FALSE, `updated_at` = '2018-07-08 16:26:13' WHERE `players`.`id` = 68
UPDATE `players` SET `active` = TRUE, `updated_at` = '2018-07-08 16:26:13' WHERE `players`.`id` = 67
---
    def click2
        index
        for i in 0..6
            while @column2[i].belongsTo == ''
                @column2[i].belongsTo = @player.name
                @column2[i].save
                @player.active = false
                @player.save
                @inActivePlayer.active = true
                @inActivePlayer.save

UPDATE `players` SET `active` = FALSE, `updated_at` = '2018-07-08 15:51:49' WHERE `players`.`id` = 64
UPDATE `players` SET `active` = FALSE, `updated_at` = '2018-07-08 01:05:58' WHERE `players`.`id` = 49
---
    def click3
        index
        for i in 0..6
            while @column3[i].belongsTo == ''
                @column3[i].belongsTo = @player.name
                @column3[i].save
                @player.active = false
                @player.save
                @inActivePlayer.active = true
                @inActivePlayer.save

UPDATE `players` SET `active` = FALSE, `updated_at` = '2018-07-08 01:21:52' WHERE `players`.`id` = 49
UPDATE `players` SET `active` = FALSE, `updated_at` = '2018-07-08 01:07:52' WHERE `players`.`id` = 50
---
    def click4
        index
        for i in 0..6
            while @column4[i].belongsTo == ''
                @column4[i].belongsTo = @player.name
                @column4[i].save
                @player.active = false
                @player.save
                @inActivePlayer.active = true
                @inActivePlayer.save

UPDATE `players` SET `active` = FALSE, `updated_at` = '2018-07-08 15:51:46' WHERE `players`.`id` = 64
UPDATE `players` SET `active` = TRUE, `updated_at` = '2018-07-08 15:51:46' WHERE `players`.`id` = 63
---
    def click5
        index
        for i in 0..6
            while @column5[i].belongsTo == ''
                @column5[i].belongsTo = @player.name
                @column5[i].save
                @player.active = false
                @player.save
                @inActivePlayer.active = true
                @inActivePlayer.save

UPDATE `players` SET `active` = FALSE, `updated_at` = '2018-07-08 15:51:56' WHERE `players`.`id` = 63
UPDATE `players` SET `active` = TRUE, `updated_at` = '2018-07-08 15:51:56' WHERE `players`.`id` = 64
---
    def click6
        index
        for i in 0..6
            while @column6[i].belongsTo == ''
                @column6[i].belongsTo = @player.name
                @column6[i].save
                @player.active = false
                @player.save
                @inActivePlayer.active = true
                @inActivePlayer.save

UPDATE `players` SET `active` = FALSE, `updated_at` = '2018-07-08 15:51:58' WHERE `players`.`id` = 64
UPDATE `players` SET `active` = TRUE, `updated_at` = '2018-07-08 15:51:58' WHERE `players`.`id` = 63
---
    def click7
        index
        for i in 0..6
            while @column7[i].belongsTo == ''
                @column7[i].belongsTo = @player.name
                @column7[i].save
                @player.active = false
                @player.save
                @inActivePlayer.active = true
                @inActivePlayer.save